[
	{
		"id": "c67ab8a7",
		"title": "Booki - Agence de voyages",
		"cover": "http://zakari.manuso.fr/booki_couverture.png",
		"pictures": [
			"http://zakari.manuso.fr/booki_smartphone_.png",
			"http://zakari.manuso.fr/booki_desktop_.png",
			"http://zakari.manuso.fr/booki_tablette_.png"
		],
		"description": "Projet d'étude dans le cadre de ma formation diplômante RNCP 2. Implémentation du front en HTML/CSS pour une agence de voyages fictive à partir d'une maquette. J'ai appris et utilisé la sémantique et les différentes balises Html.",
        "problematique": "Le souci que j'ai eu à gérer est sur la barre de recherche. Je devais mettre l'icône du lieu en bleu au  clic sur le champ recherche. Or, on ne peut pas appliquer un style sur un élément parent. J'ai dû faire une petite gymnastique pour inverser l'ordre des éléments dans le code mais les laisser dans le bon ordre visuel.",
		"competences": "Ce projet est à la base de tout mon apprentissage dans le développement, j'ai appris la persévérance lorsque tous ne fonctionnent pas comme on le souhaite, mais aussi le fait de savoir prendre du recul. Et bien évidemment, la satisfaction quand tous fonctionne.",
        "lien": "https://zackka.github.io/Booki1.0/",
		"techno": [
			"HTML",
			"CSS"
		]
	},
	{
		"id": "b9123946",
		"title": "Sophie Bluel - Architecte d'intérieur",
		"cover": "http://zakari.manuso.fr/sophie_buel_couverture.jpg",
		"pictures": [
			"http://zakari.manuso.fr/sophie_buel_acceuil_.png",
			"http://zakari.manuso.fr/sophie_buel_connecter_.png",
			"http://zakari.manuso.fr/sohpie_buel_modal_.PNG",
			"http://zakari.manuso.fr/sophie_buel_login.html_.png"
		],
		"description": "Pour ce site d'architecte d'intérieur, j'ai implémenté le front de ce site en utilisant du HTML/Css ainsi que du Javascript. J'ai utilisé le JS principalement pour faire mes requêtes à l'api (GET, POST, PUT, DELETE). J'ai expérimenté l'utilisation de filtre mais aussi le status 'actif' qu'un élément peut avoir, notamment pour l'ouverture et la fermeture de modal. Et ainsi pouvoir afficher ces éléments selon certaines conditions.",
        "problematique": "Comment enregistrer le token renvoyer par la page de login et l'appliquer sur la page principal pour pouvoir ainsi modifier le contenue ? C'est la problématique que j'ai réglé grâce au window storage.",
		"competences": "Grâce à ce projet j'ai accru mon esprit d'analyse ainsi que ma patience. En effet, pendant la phase de développement j'ai dû faire face à des soucis avec mes requêtes à l'api et j'ai donc dû faire preuve de patience pour résoudre ces soucis.",
        "lien": "https://github.com/ZackKa/Projet3_site_Architecte-Interieur",
		"techno": [
			"HTML",
			"CSS",
			"JavaScript"
		]
	},
	{
		"id": "a6d188c5",
		"title": "Nina Carducci - Photographe",
		"cover": "http://zakari.manuso.fr/nina_carducci_couverture.jpg",
		"pictures": [
			"http://zakari.manuso.fr/nina_carducci_.png"
		],
		"description": "Sur ce projet, je n'ai pas codé, mais je me suis occupé de l'optimisation du site et j'ai résolu 2 bugs. J'ai optimisé les performances, l'accessibilité ainsi que le référencement. Je me suis principalement occupé des images qui étaient volumineuses. Grâce aux outils Lighthouse et Wave, j'ai pu avoir des chiffres quant aux éléments optimisés ainsi que des analyses pour l'accessibilité.",
		"problematique": "Les images ne sont pas à prendre à la légère car elles peuvent être volumineuse et donc affectées les performances. Le souci pour moi a été de trouver le bon équilibre entre la qualité et le volume, en modifiant ces images.",
		"competences": "L'intelligence émotionnelle est une compétence indéniable à avoir. Car si on ne se fie qu'aux chiffres des outils comme lighthouse, on peut vite être frustré par le changement ou le non-changement des résultats des audits lighthouse, et cela à un impact réel sur la productivité.",
        "lien": "https://zackka.github.io/Projet_5_Nina_Carducci/",
		"techno": [
			"Lighthouse",
			"Wave",
			"Schema.org"
		]
	},
	{
		"id": "a7f00cd6",
		"title": "Kasa - Location d'appartements",
		"cover": "http://zakari.manuso.fr/kasa_couverture.jpg",
		"pictures": [
			"http://zakari.manuso.fr/kasa_acceuil_.png",
			"http://zakari.manuso.fr/kasa_a_propos_.png",
			"http://zakari.manuso.fr/kasa_error_404_.png",
			"http://zakari.manuso.fr/kasa_logement_.png"
		],
		"description": "Kasa est une application de location de bien immobilier dont j'ai fait la refonte en React. J'ai expérimenté les différents aspects de React comme les composants, les hooks (comme useState et useEffect) ou encore les propos. Grâce aux propos et aux hooks j'ai créé un collapse ainsi qu'un carrousel qui embellissent et ajoutent des fonctionnalités intéressantes à l'application.",
		"problematique": "Le problème que j'ai eu à résoudre était pour la redirection sur la page erreur dans le cas où on entre une URL de page de logement non correspondante aux logements de l'application. J'ai résolu ce problème en comparant l'id dans l'URL et celui du logement, et ainsi renvoyer la page erreur quand ils ne se correspondent pas.",
		"competences": "Grâce à ce projet j'ai affuté mon esprit d'analyse et après avoir résolu le souci énoncé ci-dessus j'ai accru ma confiance en moi.",
        "lien": "https://github.com/ZackKa/Projet6_Kasa",
		"techno": [
			"React.js",
			"Sass"
		]
	},
	{
		"id": "a979876d",
		"title": "Mon vieux grimoire - Notation de livres",
		"cover": "http://zakari.manuso.fr/mon_vieux_grimoire_couverture.jpg",
		"pictures": [
			"http://zakari.manuso.fr/mon_vieux_grimoire_acceuil_.png",
			"http://zakari.manuso.fr/mon_vieux_grimoire_ajout_.png",
			"http://zakari.manuso.fr/mon_vieux_grimoire_fiche_livre_.png",
			"http://zakari.manuso.fr/mon_vieux_grimoire_login_.png"
		],
		"description": "Sur ce projet, j'ai abordé un aspect different de ce que j'ai déjà fait précédemment car je me suis attaqué au back-end d'un site de notation de livre. J'ai utilisé le Javascript dans un contexte different pour mettre en place des middlewares ainsi que des controllers. J'ai aussi augmenté la sécurité en utilisant des outils comme, une rate-limit, le Jwt et des variables d'environnement en passant par le cloisonnement de la base de données.",
		"problematique": "Avec tous les hackers qui essayent de déjouer la sécurité sur les différents sites, je me suis demandé comment empêcher que des hackers ne trouvent les mots de passe utilisateurs. Sachant que beaucoup d'entre eux utilisent des dictionnaires pour tester des mots de passe à la suite. J'ai pour cela mis en place un rate-limit pour limiter le nombre de tentatives et mettre un timing avant de pouvoir tenter à nouveau la connexion.",
		"competences": "À la différence du front-end on n'a pas de visuel sur nos modifications de code, il faut donc savoir prendre du recul. J'ai logiquement dû faire preuve de patience et faire appel à mon intelligence émotionnelle.",
        "lien": "https://github.com/ZackKa/Projet7_Mon_Vieux_Grimoire",
		"techno": [
			"Node.js",
			"Express",
			"MongoDB"
		]
	}
]